'''
字符串切片

字符串或字符串变量[起始下标：结束下标：步长]
'''

def slice_test():
    s = '01234567890123456789'

    s1 = s[2:4]

    print(s1)
    print(s)

    print(s[0:len(s)])

    print(s[:]) # 复制全串
    print(s[5:]) # 从下标5开始切到最后

    print(s[:10]) # 从0开始，切到9
    print(s[3:11]) # 从3切到第二个0

    print(s[::1]) # 步长默认为1
    print(s[::2]) # 步长设置为2
    print(s[2:15:4])

    # 步长可以取负值，负值表示从右向左切，但是下标还是从左往右数
    print(s[10:2:-1])
    print(s[::-1]) # 字符串逆序

    # 下标也可以使用负数
    print(s[-1:-5:1])
    print(s[-1:-5:-1])


slice_test()

